"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def calc():
    calc_result = 0
    operands = ('+', '-', '*', '/')
    operand = input('Введите операцию (+, -, *, / или 0 для выхода):')
    if operand == '0':          # базовое условие
        print('Работа программы завершена.')
        return
    elif operand not in operands:
        print('Неверный оператор!')
        return calc()
    try:                        # шаг рекурсии
        num_1 = float(input('Введите первое число:'))
        num_2 = float(input('Введите второе число:'))
        if operand == '+':
            calc_result = num_1 + num_2
        elif operand == '-':
            calc_result = num_1 - num_2
        elif operand == '*':
            calc_result = num_1 * num_2
        elif operand == '/' and num_2 ==0:
            print('Невозможно разделить на 0.')
            return calc()
        elif operand == '/' and num_2 != 0:
            calc_result = num_1 / num_2
    except ValueError:
        print('Вы ввели не число! Пожалуйста, не делайте так.')
        return calc()
    print(f"Ваш результат: {calc_result}")
    return calc()

calc()