"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Массив в этом задании строить нельзя!
Нужно решить без него!

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

n = int(input('Сколько чисел из ряда вы хотите сложить?'))
def numbers_sum(n, sum = 0, first_number = 1):
    if n == 0:      # базовый случай
        return (f"Сумма чисел составляет {sum}.")
    else:           # шаг рекурсии
        return numbers_sum((n - 1), sum + first_number, first_number * (-0.5))

print(numbers_sum(n))