"""
Задание 5.
Задание на закрепление навыков работы со стеком

Реализуйте структуру "стопка тарелок".

Мы можем складывать тарелки в стопку и при превышении некоторого значения
нужно начать складывать тарелки в новую стопку.

Структура должна предусматривать наличие нескольких стеков.
Создание нового стека происходит при достижении предыдущим стеком порогового значения.
Реализуйте по аналогии с примером, рассмотренным на уроке, необходимые методы,
для реализации это структуры, добавьте новые методы (не рассмотренные в примере с урока)
для реализации этой задачи.

После реализации структуры, проверьте ее работу на различных сценариях

Подсказка:
Отдельне стопки можно реализовать через:
1) созд-е экземпляров стека (если стопка - класс)
или
2) lst = [[], [], [], [],....]

Примечание: в этом задании вспомните ваши знания по работе с ООП
и опирайтесь на пример урока

Прошу вас внимательно читать ТЗ и не забыть выполнить все пункты.

Задание творческое. Здесь нет жестких требований к выполнению.
"""

class StackOfPlates:
    def __init__(self, size_of_stack):
        self.elems = []
        self.size_of_stack = size_of_stack

    def put_plate(self, el):
        if len(self.elems) <= len(self.size_of_stack[len(self.size_of_stack) - 1])
            self.elems.append(el)
        else:
            print('Максимальная высота стопки! Начинаю новую.')
            self.elems.append([])
            self.elems[len(self.elems)].append(el)

    def remove_plate(self):
        return self.elems.pop()