"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены

Используем операции % //, НЕ ИСПОЛЬЗУЕМ ОПЕРАЦИИ ВЗЯТИЯ ЭЛЕМЕНТА ПО ИНДЕКСУ

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

Не забудьте проверить и на числах, заканчивающихся нулем.
Пример:
Введите число, которое требуется перевернуть: 1230
Перевернутое число: 0321

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def inside_out(your_number, number_reversed = ''):
    if your_number == 0:  # базовый случай
        return number_reversed
    try:
        last_digit = your_number % 10  # шаг рекурсии
        number_reversed += str(last_digit)
        return inside_out(your_number // 10, number_reversed)
    except TypeError:
        print('Вы ввели не число! Пожалуйста, не делайте так.')
        return


print(inside_out('445010'))
print(inside_out(2129854))