"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import defaultdict

companies = defaultdict(list)
companies_count = int(input('Пожалуйста, введите количество вносимых предприятий: '))

for i in range(companies_count):
    name = input('Пожалуйста, введите название предприятия: ')
    income = map(int, input('Введите прибыль за четыре квартала через пробел: ').split())
    companies[name] = sum(income)

average_income = sum(companies.values()) / companies_count
more_average = []
less_average = []

for name, inc in companies.items():
    if inc >= average_income:
        more_average.append(name)
    else:
        less_average.append(name)

print(f'Средняя годовая прибыль всех предприятий: {average_income}. Предприятия с прибылью выше среднего значения: {more_average}. Предприятия с прибылью ниже среднего значения: {less_average}')
